app/Controllers/EmployeeController.php

SELECT *
FROM `department`
WHERE `status` = 1
---
    public function index()
    {
        $data = [];
        $data['activeMenu'] = 'employee';
        $data['assetsJs'] = array('app-employee-list');

        $data['departments'] = $this->departmentModel->where('status=', 1)->findAll();