app/Models/AuthModel.php

INSERT INTO `auth_logins` (`employee_id`, `employee_name`, `employee_type`, `ip_address`, `date`, `successful`) VALUES ('1', 'Sajid Ahmad', 'admin', '::1', '2024-12-31 10:08:46', '1')
---
    public function LogLogin($data) {
        $this->db->table('auth_logins')
                ->insert($data);