app/Models/DepartmentDataTableModel.php

SELECT COUNT(*) AS `numrows`
FROM `department` as `dp`
WHERE `dp`.`status` != 2
AND `dp`.`status` != 2
---
    public function count_all($data_where) {
        $db = \Config\Database::connect();
        $builder = $db->table('department as dp');
        $builder->select('dp.*');
        $builder->where('dp.status !=', 2);
        $this->applySearchFilters($builder, $data_where);
        return $builder->countAllResults();