app/Models/EmployeementModel.php

    function getAllCount() {
        $query = $this->db->table('employee')->where('status!=', 2)->where('trash', 0)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `employee`
WHERE `status` != 2
AND `trash` = 0

    function InactiveCount() {
        $query = $this->db->table('employee')->select('*')->where('status', 0)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `employee`
WHERE `status` = 0

    public function activeCount() {
        $query = $this->db->table('employee')->select('*')->where('trash', 0)->where('status', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `employee`
WHERE `trash` = 0
AND `status` = 1