app/Libraries/AuthLibrary.php

SELECT *
FROM `department`
WHERE `department_id` = '1'
 LIMIT 1
---
    public function setUserSession($user) {
        $department = $this->DepartmentModel->where('department_id', $user['department_id'])->first();